app/controllers/sessions_controller.rb

  def create
    if( User.where("user_id = ?", params[:user][:user_id]).first != nil )
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = 'nick' LIMIT 1