app/controllers/users_controller.rb

  def create
    if( User.where("user_id = ?", params[:user][:user_id]).first ==  nil )
       @user = User.create_user!(params[:user])
---
SELECT "users".* FROM "users" WHERE (:user_id = 'timotyjfas') LIMIT 1
INSERT INTO "users" ("created_at", "email", "session_token", "timestamps", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 06 Oct 2014 01:37:04 UTC +00:00], ["email", nil], ["session_token", nil], ["timestamps", nil], ["updated_at", Mon, 06 Oct 2014 01:37:04 UTC +00:00], ["user_id", nil]]